.outdated/shared/output/load-15-2025-10-26-20-29-50/k6-test-nvidia.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

time="2025-10-26T20:29:50+01:00" level=info msg="CSV LOCATION:  /Users/urosceh/Code/zilla-minikube/shared/passwords/nvidia/nvidia.csv" source=console
time="2025-10-26T20:29:50+01:00" level=info msg="[nvidia] Loaded 200 users from CSV" source=console
time="2025-10-26T20:29:50+01:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""
     execution: local
        script: /Users/urosceh/Code/zilla-minikube/shared/k6/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-10-26T20:29:50+01:00" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: address already in use"
time="2025-10-26T20:29:50+01:00" level=info msg="[nvidia] LOAD TEST SETUP" source=console
time="2025-10-26T20:29:51+01:00" level=info msg="[nvidia] Admin token obtained" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:53+01:00" level=info msg="[nvidia] Created 20 projects" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:54+01:00" level=info msg="Created 5 sprints for project LDT0" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:56+01:00" level=info msg="Created 50 issues for project LDT0" source=console
time="2025-10-26T20:29:56+01:00" level=info msg="Granting access for project LDT0 0. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:57+01:00" level=info msg="Granted access for project LDT0 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:58+01:00" level=info msg="Created 5 sprints for project LDT1" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:59+01:00" level=info msg="Created 50 issues for project LDT1" source=console
time="2025-10-26T20:29:59+01:00" level=info msg="Granting access for project LDT1 1. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:00+01:00" level=info msg="Granted access for project LDT1 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:01+01:00" level=info msg="Created 5 sprints for project LDT2" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:02+01:00" level=info msg="Created 50 issues for project LDT2" source=console
time="2025-10-26T20:30:02+01:00" level=info msg="Granting access for project LDT2 2. 10 users" source=console
time="2025-10-26T20:30:03+01:00" level=info msg="Granted access for project LDT2 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:04+01:00" level=info msg="Created 5 sprints for project LDT3" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:05+01:00" level=info msg="Created 50 issues for project LDT3" source=console
time="2025-10-26T20:30:05+01:00" level=info msg="Granting access for project LDT3 3. 10 users" source=console
time="2025-10-26T20:30:06+01:00" level=info msg="Granted access for project LDT3 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:07+01:00" level=info msg="Created 5 sprints for project LDT4" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:08+01:00" level=info msg="Created 50 issues for project LDT4" source=console
time="2025-10-26T20:30:08+01:00" level=info msg="Granting access for project LDT4 4. 10 users" source=console
time="2025-10-26T20:30:09+01:00" level=info msg="Granted access for project LDT4 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:10+01:00" level=info msg="Created 5 sprints for project LDT5" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:11+01:00" level=info msg="Created 50 issues for project LDT5" source=console
time="2025-10-26T20:30:11+01:00" level=info msg="Granting access for project LDT5 5. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:12+01:00" level=info msg="Granted access for project LDT5 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:13+01:00" level=info msg="Created 5 sprints for project LDT6" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:14+01:00" level=info msg="Created 50 issues for project LDT6" source=console
time="2025-10-26T20:30:14+01:00" level=info msg="Granting access for project LDT6 6. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:15+01:00" level=info msg="Granted access for project LDT6 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:16+01:00" level=info msg="Created 5 sprints for project LDT7" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:17+01:00" level=info msg="Created 50 issues for project LDT7" source=console
time="2025-10-26T20:30:17+01:00" level=info msg="Granting access for project LDT7 7. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:17+01:00" level=info msg="Granted access for project LDT7 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:18+01:00" level=info msg="Created 5 sprints for project LDT8" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:20+01:00" level=info msg="Created 50 issues for project LDT8" source=console
time="2025-10-26T20:30:20+01:00" level=info msg="Granting access for project LDT8 8. 10 users" source=console
time="2025-10-26T20:30:20+01:00" level=info msg="Granted access for project LDT8 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:21+01:00" level=info msg="Created 5 sprints for project LDT9" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:23+01:00" level=info msg="Created 50 issues for project LDT9" source=console
time="2025-10-26T20:30:23+01:00" level=info msg="Granting access for project LDT9 9. 10 users" source=console
time="2025-10-26T20:30:23+01:00" level=info msg="Granted access for project LDT9 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:24+01:00" level=info msg="Created 5 sprints for project LDT10" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:26+01:00" level=info msg="Created 50 issues for project LDT10" source=console
time="2025-10-26T20:30:26+01:00" level=info msg="Granting access for project LDT10 10. 10 users" source=console
time="2025-10-26T20:30:26+01:00" level=info msg="Granted access for project LDT10 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:27+01:00" level=info msg="Created 5 sprints for project LDT11" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:28+01:00" level=info msg="Created 50 issues for project LDT11" source=console
time="2025-10-26T20:30:28+01:00" level=info msg="Granting access for project LDT11 11. 10 users" source=console
time="2025-10-26T20:30:29+01:00" level=info msg="Granted access for project LDT11 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:30+01:00" level=info msg="Created 5 sprints for project LDT12" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:32+01:00" level=info msg="Created 50 issues for project LDT12" source=console
time="2025-10-26T20:30:32+01:00" level=info msg="Granting access for project LDT12 12. 10 users" source=console
time="2025-10-26T20:30:32+01:00" level=info msg="Granted access for project LDT12 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:33+01:00" level=info msg="Created 5 sprints for project LDT13" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:35+01:00" level=info msg="Created 50 issues for project LDT13" source=console
time="2025-10-26T20:30:35+01:00" level=info msg="Granting access for project LDT13 13. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:35+01:00" level=info msg="Granted access for project LDT13 to 10 users" source=console
time="2025-10-26T20:30:36+01:00" level=info msg="Created 5 sprints for project LDT14" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:38+01:00" level=info msg="Created 50 issues for project LDT14" source=console
time="2025-10-26T20:30:38+01:00" level=info msg="Granting access for project LDT14 14. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:38+01:00" level=info msg="Granted access for project LDT14 to 10 users" source=console
time="2025-10-26T20:30:39+01:00" level=info msg="Created 5 sprints for project LDT15" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:41+01:00" level=info msg="Created 50 issues for project LDT15" source=console
time="2025-10-26T20:30:41+01:00" level=info msg="Granting access for project LDT15 15. 10 users" source=console
time="2025-10-26T20:30:41+01:00" level=info msg="Granted access for project LDT15 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:42+01:00" level=info msg="Created 5 sprints for project LDT16" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:44+01:00" level=info msg="Created 50 issues for project LDT16" source=console
time="2025-10-26T20:30:44+01:00" level=info msg="Granting access for project LDT16 16. 10 users" source=console
time="2025-10-26T20:30:44+01:00" level=info msg="Granted access for project LDT16 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:45+01:00" level=info msg="Created 5 sprints for project LDT17" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:47+01:00" level=info msg="Created 50 issues for project LDT17" source=console
time="2025-10-26T20:30:47+01:00" level=info msg="Granting access for project LDT17 17. 10 users" source=console
time="2025-10-26T20:30:47+01:00" level=info msg="Granted access for project LDT17 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:48+01:00" level=info msg="Created 5 sprints for project LDT18" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:50+01:00" level=info msg="Created 50 issues for project LDT18" source=console
time="2025-10-26T20:30:50+01:00" level=info msg="Granting access for project LDT18 18. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:50+01:00" level=info msg="Granted access for project LDT18 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:52+01:00" level=info msg="Created 5 sprints for project LDT19" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:53+01:00" level=info msg="Created 50 issues for project LDT19" source=console
time="2025-10-26T20:30:53+01:00" level=info msg="Granting access for project LDT19 19. 10 users" source=console
time="2025-10-26T20:30:54+01:00" level=info msg="Granted access for project LDT19 to 10 users" source=console
time="2025-10-26T20:30:54+01:00" level=info msg="[nvidia] Setup complete" source=console

running (1m04.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m00.4s/3m00.0s

running (1m05.0s), 02/30 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m01.4s/3m00.0s

running (1m06.0s), 03/30 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 03/30 VUs  0m02.4s/3m00.0s

running (1m07.0s), 04/30 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 04/30 VUs  0m03.4s/3m00.0s

running (1m08.0s), 05/30 VUs, 7 complete and 0 interrupted iterations
default   [   2% ] 05/30 VUs  0m04.4s/3m00.0s

running (1m09.0s), 06/30 VUs, 8 complete and 0 interrupted iterations
default   [   3% ] 06/30 VUs  0m05.4s/3m00.0s

running (1m10.0s), 07/30 VUs, 11 complete and 0 interrupted iterations
default   [   4% ] 07/30 VUs  0m06.4s/3m00.0s

running (1m11.0s), 08/30 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 08/30 VUs  0m07.4s/3m00.0s

running (1m12.0s), 09/30 VUs, 17 complete and 0 interrupted iterations
default   [   5% ] 09/30 VUs  0m08.4s/3m00.0s

running (1m13.0s), 10/30 VUs, 19 complete and 0 interrupted iterations
default   [   5% ] 10/30 VUs  0m09.4s/3m00.0s

running (1m14.0s), 11/30 VUs, 24 complete and 0 interrupted iterations
default   [   6% ] 11/30 VUs  0m10.4s/3m00.0s

running (1m15.0s), 12/30 VUs, 26 complete and 0 interrupted iterations
default   [   6% ] 12/30 VUs  0m11.4s/3m00.0s

running (1m16.0s), 12/30 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 12/30 VUs  0m12.4s/3m00.0s

running (1m17.0s), 13/30 VUs, 34 complete and 0 interrupted iterations
default   [   7% ] 13/30 VUs  0m13.4s/3m00.0s

running (1m18.0s), 14/30 VUs, 40 complete and 0 interrupted iterations
default   [   8% ] 14/30 VUs  0m14.4s/3m00.0s

running (1m19.0s), 15/30 VUs, 46 complete and 0 interrupted iterations
default   [   9% ] 15/30 VUs  0m15.4s/3m00.0s

running (1m20.0s), 16/30 VUs, 48 complete and 0 interrupted iterations
default   [   9% ] 16/30 VUs  0m16.4s/3m00.0s

running (1m21.0s), 17/30 VUs, 57 complete and 0 interrupted iterations
default   [  10% ] 17/30 VUs  0m17.4s/3m00.0s

running (1m22.0s), 18/30 VUs, 60 complete and 0 interrupted iterations
default   [  10% ] 18/30 VUs  0m18.4s/3m00.0s

running (1m23.0s), 19/30 VUs, 64 complete and 0 interrupted iterations
default   [  11% ] 19/30 VUs  0m19.4s/3m00.0s

running (1m24.0s), 20/30 VUs, 68 complete and 0 interrupted iterations
default   [  11% ] 20/30 VUs  0m20.4s/3m00.0s

running (1m25.0s), 21/30 VUs, 75 complete and 0 interrupted iterations
default   [  12% ] 21/30 VUs  0m21.4s/3m00.0s

running (1m26.0s), 22/30 VUs, 78 complete and 0 interrupted iterations
default   [  12% ] 22/30 VUs  0m22.4s/3m00.0s

running (1m27.0s), 23/30 VUs, 84 complete and 0 interrupted iterations
default   [  13% ] 23/30 VUs  0m23.4s/3m00.0s

running (1m28.0s), 24/30 VUs, 90 complete and 0 interrupted iterations
default   [  14% ] 24/30 VUs  0m24.4s/3m00.0s

running (1m29.0s), 25/30 VUs, 98 complete and 0 interrupted iterations
default   [  14% ] 25/30 VUs  0m25.4s/3m00.0s

running (1m30.0s), 26/30 VUs, 104 complete and 0 interrupted iterations
default   [  15% ] 26/30 VUs  0m26.4s/3m00.0s

running (1m31.0s), 27/30 VUs, 109 complete and 0 interrupted iterations
default   [  15% ] 27/30 VUs  0m27.4s/3m00.0s

running (1m32.0s), 28/30 VUs, 117 complete and 0 interrupted iterations
default   [  16% ] 28/30 VUs  0m28.4s/3m00.0s

running (1m33.0s), 29/30 VUs, 124 complete and 0 interrupted iterations
default   [  16% ] 29/30 VUs  0m29.4s/3m00.0s

running (1m34.0s), 30/30 VUs, 128 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m30.4s/3m00.0s

running (1m35.0s), 30/30 VUs, 135 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m31.4s/3m00.0s

running (1m36.0s), 30/30 VUs, 144 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m32.4s/3m00.0s

running (1m37.0s), 30/30 VUs, 151 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m33.4s/3m00.0s

running (1m38.0s), 30/30 VUs, 160 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m34.4s/3m00.0s

running (1m39.0s), 30/30 VUs, 167 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m35.4s/3m00.0s

running (1m40.0s), 30/30 VUs, 173 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m36.4s/3m00.0s

running (1m41.0s), 30/30 VUs, 178 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m37.4s/3m00.0s

running (1m42.0s), 30/30 VUs, 189 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m38.4s/3m00.0s

running (1m43.0s), 30/30 VUs, 196 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m39.4s/3m00.0s

running (1m44.0s), 30/30 VUs, 204 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m40.4s/3m00.0s

running (1m45.0s), 30/30 VUs, 212 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m41.4s/3m00.0s

running (1m46.0s), 30/30 VUs, 216 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m42.4s/3m00.0s

running (1m47.0s), 30/30 VUs, 230 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m43.4s/3m00.0s

running (1m48.0s), 30/30 VUs, 235 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m44.4s/3m00.0s

running (1m49.0s), 30/30 VUs, 245 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m45.4s/3m00.0s

running (1m50.0s), 30/30 VUs, 250 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m46.4s/3m00.0s

running (1m51.0s), 30/30 VUs, 255 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m47.4s/3m00.0s

running (1m52.0s), 30/30 VUs, 263 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m48.4s/3m00.0s

running (1m53.0s), 30/30 VUs, 272 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m49.4s/3m00.0s

running (1m54.0s), 30/30 VUs, 278 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m50.4s/3m00.0s

running (1m55.0s), 30/30 VUs, 281 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m51.4s/3m00.0s

running (1m56.0s), 30/30 VUs, 291 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m52.4s/3m00.0s

running (1m57.0s), 30/30 VUs, 298 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m53.4s/3m00.0s

running (1m58.0s), 30/30 VUs, 302 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m54.4s/3m00.0s

running (1m59.0s), 30/30 VUs, 309 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m55.4s/3m00.0s

running (2m00.0s), 30/30 VUs, 322 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m56.4s/3m00.0s

running (2m01.0s), 30/30 VUs, 328 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m57.4s/3m00.0s

running (2m02.0s), 30/30 VUs, 335 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m58.4s/3m00.0s

running (2m03.0s), 30/30 VUs, 342 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  0m59.4s/3m00.0s

running (2m04.0s), 30/30 VUs, 347 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m00.4s/3m00.0s

running (2m05.0s), 30/30 VUs, 362 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m01.4s/3m00.0s

running (2m06.0s), 30/30 VUs, 368 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m02.4s/3m00.0s

running (2m07.0s), 30/30 VUs, 377 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m03.4s/3m00.0s

running (2m08.0s), 30/30 VUs, 392 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m04.4s/3m00.0s

running (2m09.0s), 30/30 VUs, 405 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m05.4s/3m00.0s

running (2m10.0s), 30/30 VUs, 414 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m06.4s/3m00.0s

running (2m11.0s), 30/30 VUs, 426 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m07.4s/3m00.0s

running (2m12.0s), 30/30 VUs, 437 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m08.4s/3m00.0s

running (2m13.0s), 30/30 VUs, 446 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m09.4s/3m00.0s

running (2m14.0s), 30/30 VUs, 462 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m10.4s/3m00.0s

running (2m15.0s), 30/30 VUs, 472 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m11.4s/3m00.0s

running (2m16.0s), 30/30 VUs, 486 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m12.4s/3m00.0s

running (2m17.0s), 30/30 VUs, 493 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m13.4s/3m00.0s

running (2m18.0s), 30/30 VUs, 498 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m14.4s/3m00.0s

running (2m19.0s), 30/30 VUs, 509 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m15.4s/3m00.0s

running (2m20.0s), 30/30 VUs, 520 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m16.4s/3m00.0s

running (2m21.0s), 30/30 VUs, 528 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m17.4s/3m00.0s

running (2m22.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m18.4s/3m00.0s

running (2m23.0s), 30/30 VUs, 551 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m19.4s/3m00.0s

running (2m24.0s), 30/30 VUs, 561 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m20.4s/3m00.0s

running (2m25.0s), 30/30 VUs, 572 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m21.4s/3m00.0s

running (2m26.0s), 30/30 VUs, 582 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m22.4s/3m00.0s

running (2m27.0s), 30/30 VUs, 596 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m23.4s/3m00.0s

running (2m28.0s), 30/30 VUs, 606 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m24.4s/3m00.0s

running (2m29.0s), 30/30 VUs, 619 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m25.4s/3m00.0s

running (2m30.0s), 30/30 VUs, 627 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m26.4s/3m00.0s

running (2m31.0s), 30/30 VUs, 640 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m27.4s/3m00.0s

running (2m32.0s), 30/30 VUs, 652 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m28.4s/3m00.0s

running (2m33.0s), 30/30 VUs, 659 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m29.4s/3m00.0s

running (2m34.0s), 30/30 VUs, 671 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m30.4s/3m00.0s

running (2m35.0s), 30/30 VUs, 681 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m31.4s/3m00.0s

running (2m36.0s), 30/30 VUs, 694 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m32.4s/3m00.0s

running (2m37.0s), 30/30 VUs, 702 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m33.4s/3m00.0s

running (2m38.0s), 30/30 VUs, 716 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m34.4s/3m00.0s

running (2m39.0s), 30/30 VUs, 726 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m35.4s/3m00.0s

running (2m40.0s), 30/30 VUs, 738 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m36.4s/3m00.0s

running (2m41.0s), 30/30 VUs, 749 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m37.4s/3m00.0s

running (2m42.0s), 30/30 VUs, 757 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m38.4s/3m00.0s

running (2m43.0s), 30/30 VUs, 768 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m39.4s/3m00.0s

running (2m44.0s), 30/30 VUs, 779 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m40.4s/3m00.0s

running (2m45.0s), 30/30 VUs, 790 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m41.4s/3m00.0s

running (2m46.0s), 30/30 VUs, 801 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m42.4s/3m00.0s

running (2m47.0s), 30/30 VUs, 812 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m43.4s/3m00.0s

running (2m48.0s), 30/30 VUs, 823 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m44.4s/3m00.0s

running (2m49.0s), 30/30 VUs, 833 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m45.4s/3m00.0s

running (2m50.0s), 30/30 VUs, 841 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m46.4s/3m00.0s

running (2m51.0s), 30/30 VUs, 852 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m47.4s/3m00.0s

running (2m52.0s), 30/30 VUs, 861 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m48.4s/3m00.0s

running (2m53.0s), 30/30 VUs, 870 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m49.4s/3m00.0s

running (2m54.0s), 30/30 VUs, 881 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m50.4s/3m00.0s

running (2m55.0s), 30/30 VUs, 893 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m51.4s/3m00.0s

running (2m56.0s), 30/30 VUs, 902 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m52.4s/3m00.0s

running (2m57.0s), 30/30 VUs, 910 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m53.4s/3m00.0s

running (2m58.0s), 30/30 VUs, 921 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m54.4s/3m00.0s

running (2m59.0s), 30/30 VUs, 933 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m55.4s/3m00.0s

running (3m00.0s), 30/30 VUs, 940 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m56.4s/3m00.0s

running (3m01.0s), 30/30 VUs, 951 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m57.4s/3m00.0s

running (3m02.0s), 30/30 VUs, 959 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m58.4s/3m00.0s

running (3m03.0s), 30/30 VUs, 969 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m59.4s/3m00.0s

running (3m04.0s), 30/30 VUs, 978 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m00.4s/3m00.0s

running (3m05.0s), 30/30 VUs, 988 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m01.4s/3m00.0s

running (3m06.0s), 30/30 VUs, 994 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m02.4s/3m00.0s

running (3m07.0s), 30/30 VUs, 1004 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m03.4s/3m00.0s

running (3m08.0s), 30/30 VUs, 1016 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m04.4s/3m00.0s

running (3m09.0s), 30/30 VUs, 1025 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m05.4s/3m00.0s

running (3m10.0s), 30/30 VUs, 1032 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m06.4s/3m00.0s

running (3m11.0s), 30/30 VUs, 1041 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m07.4s/3m00.0s

running (3m12.0s), 30/30 VUs, 1053 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m08.4s/3m00.0s

running (3m13.0s), 30/30 VUs, 1063 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m09.4s/3m00.0s

running (3m14.0s), 30/30 VUs, 1072 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m10.4s/3m00.0s

running (3m15.0s), 30/30 VUs, 1083 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m11.4s/3m00.0s

running (3m16.0s), 30/30 VUs, 1090 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m12.4s/3m00.0s

running (3m17.0s), 30/30 VUs, 1103 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m13.4s/3m00.0s

running (3m18.0s), 30/30 VUs, 1112 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m14.4s/3m00.0s

running (3m19.0s), 30/30 VUs, 1120 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m15.4s/3m00.0s

running (3m20.0s), 30/30 VUs, 1129 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m16.4s/3m00.0s

running (3m21.0s), 30/30 VUs, 1136 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m17.4s/3m00.0s

running (3m22.0s), 30/30 VUs, 1146 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m18.4s/3m00.0s

running (3m23.0s), 30/30 VUs, 1155 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m19.4s/3m00.0s

running (3m24.0s), 30/30 VUs, 1164 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m20.4s/3m00.0s

running (3m25.0s), 30/30 VUs, 1170 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m21.4s/3m00.0s

running (3m26.0s), 30/30 VUs, 1175 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m22.4s/3m00.0s

running (3m27.0s), 30/30 VUs, 1185 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m23.4s/3m00.0s

running (3m28.0s), 30/30 VUs, 1197 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m24.4s/3m00.0s

running (3m29.0s), 30/30 VUs, 1204 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m25.4s/3m00.0s

running (3m30.0s), 30/30 VUs, 1212 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m26.4s/3m00.0s

running (3m31.0s), 30/30 VUs, 1223 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m27.4s/3m00.0s

running (3m32.0s), 30/30 VUs, 1230 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m28.4s/3m00.0s

running (3m33.0s), 30/30 VUs, 1242 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m29.4s/3m00.0s

running (3m34.0s), 30/30 VUs, 1255 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m30.4s/3m00.0s

running (3m35.0s), 30/30 VUs, 1262 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m31.4s/3m00.0s

running (3m36.0s), 30/30 VUs, 1273 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  2m32.4s/3m00.0s

running (3m37.0s), 28/30 VUs, 1281 complete and 0 interrupted iterations
default   [  85% ] 28/30 VUs  2m33.4s/3m00.0s

running (3m38.0s), 26/30 VUs, 1295 complete and 0 interrupted iterations
default   [  86% ] 26/30 VUs  2m34.4s/3m00.0s

running (3m39.0s), 26/30 VUs, 1304 complete and 0 interrupted iterations
default   [  86% ] 26/30 VUs  2m35.4s/3m00.0s

running (3m40.0s), 24/30 VUs, 1321 complete and 0 interrupted iterations
default   [  87% ] 24/30 VUs  2m36.4s/3m00.0s

running (3m41.0s), 24/30 VUs, 1326 complete and 0 interrupted iterations
default   [  87% ] 24/30 VUs  2m37.4s/3m00.0s

running (3m42.0s), 23/30 VUs, 1338 complete and 0 interrupted iterations
default   [  88% ] 23/30 VUs  2m38.4s/3m00.0s

running (3m43.0s), 23/30 VUs, 1345 complete and 0 interrupted iterations
default   [  89% ] 23/30 VUs  2m39.4s/3m00.0s

running (3m44.0s), 21/30 VUs, 1360 complete and 0 interrupted iterations
default   [  89% ] 21/30 VUs  2m40.4s/3m00.0s

running (3m45.0s), 20/30 VUs, 1367 complete and 0 interrupted iterations
default   [  90% ] 20/30 VUs  2m41.4s/3m00.0s

running (3m46.0s), 19/30 VUs, 1381 complete and 0 interrupted iterations
default   [  90% ] 19/30 VUs  2m42.4s/3m00.0s

running (3m47.0s), 18/30 VUs, 1392 complete and 0 interrupted iterations
default   [  91% ] 18/30 VUs  2m43.4s/3m00.0s

running (3m48.0s), 17/30 VUs, 1402 complete and 0 interrupted iterations
default   [  91% ] 17/30 VUs  2m44.4s/3m00.0s

running (3m49.0s), 16/30 VUs, 1416 complete and 0 interrupted iterations
default   [  92% ] 16/30 VUs  2m45.4s/3m00.0s

running (3m50.0s), 15/30 VUs, 1429 complete and 0 interrupted iterations
default   [  92% ] 15/30 VUs  2m46.4s/3m00.0s

running (3m51.0s), 13/30 VUs, 1440 complete and 0 interrupted iterations
default   [  93% ] 13/30 VUs  2m47.4s/3m00.0s

running (3m52.0s), 12/30 VUs, 1450 complete and 0 interrupted iterations
default   [  94% ] 12/30 VUs  2m48.4s/3m00.0s

running (3m53.0s), 11/30 VUs, 1461 complete and 0 interrupted iterations
default   [  94% ] 11/30 VUs  2m49.4s/3m00.0s

running (3m54.0s), 11/30 VUs, 1473 complete and 0 interrupted iterations
default   [  95% ] 11/30 VUs  2m50.4s/3m00.0s

running (3m55.0s), 10/30 VUs, 1483 complete and 0 interrupted iterations
default   [  95% ] 10/30 VUs  2m51.4s/3m00.0s

running (3m56.0s), 08/30 VUs, 1497 complete and 0 interrupted iterations
default   [  96% ] 08/30 VUs  2m52.4s/3m00.0s

running (3m57.0s), 08/30 VUs, 1507 complete and 0 interrupted iterations
default   [  96% ] 08/30 VUs  2m53.4s/3m00.0s

running (3m58.0s), 06/30 VUs, 1520 complete and 0 interrupted iterations
default   [  97% ] 06/30 VUs  2m54.4s/3m00.0s

running (3m59.0s), 05/30 VUs, 1529 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  2m55.4s/3m00.0s

running (4m00.0s), 04/30 VUs, 1541 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m56.4s/3m00.0s

running (4m01.0s), 03/30 VUs, 1552 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m57.4s/3m00.0s

running (4m02.0s), 02/30 VUs, 1563 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m58.4s/3m00.0s

running (4m03.0s), 01/30 VUs, 1571 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  2m59.4s/3m00.0s
time="2025-10-26T20:33:54+01:00" level=info msg="[nvidia] Load test completed" source=console


  █ THRESHOLDS 

    http_req_duration{phase:test}
    ✗ 'p(95)<300' p(95)=1.99s
    ✗ 'p(99)<500' p(99)=2.44s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=942.43ms min=17.7ms  med=934.88ms max=27.81s p(90)=1.73s p(95)=1.89s
      { expected_response:true }...: avg=942.43ms min=17.7ms  med=934.88ms max=27.81s p(90)=1.73s p(95)=1.89s
      { phase:test }...............: avg=1.28s    min=39.75ms med=1.18s    max=27.81s p(90)=1.8s  p(95)=1.99s
    http_req_failed................: 0.00%  0 out of 4879
    http_reqs......................: 4879   20.028207/s

    EXECUTION
    iteration_duration.............: avg=2.87s    min=129.2ms med=2.59s    max=31.98s p(90)=4.36s p(95)=4.79s
    iterations.....................: 1576   6.469452/s
    vus............................: 1      min=0         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 5.8 MB 24 kB/s
    data_sent......................: 2.1 MB 8.8 kB/s



running (4m03.6s), 00/30 VUs, 1576 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  3m0s
time="2025-10-26T20:33:54+01:00" level=error msg="thresholds on metrics 'http_req_duration{phase:test}' have been crossed"